{
  "backend/main.mo": "Motoko canister defining types and in‑memory maps for videos, chunks, comments, interactions, users, and providing interaction summary logic with mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report linking a UI change to the NotificationsDropdown component and listing related packages, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, including components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme design tokens and base styles for the app.",
  "frontend/index.html": "Root HTML document loading the React app with PWA and meta tags configured.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and display settings.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, cache cleanup, and offline strategies excluding large media and IC API calls.",
  "frontend/src/App.tsx": "Main React entry configuring routing, React Query client, theme provider, and service worker registration.",
  "frontend/src/components/account/ProfileMenu.tsx": "Renders a user profile dropdown menu with avatar, navigation links, theme toggle, and sign-in/out handling based on Internet Identity state.",
  "frontend/src/components/account/ThemeToggleMenuItems.tsx": "Provides dropdown items to switch between light, dark, and system themes using next-themes.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar listing primary routes with icons and active state detection.",
  "frontend/src/components/ChannelHeader.tsx": "Renders a channel header with avatar, stats, and follow button, with skeleton loading state.",
  "frontend/src/components/CommentSection.tsx": "Displays comments for a video and provides authenticated users a form to post new comments, with loading placeholders.",
  "frontend/src/components/FollowButton.tsx": "A follow/unfollow toggle button with simulated async handling and login enforcement.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search, notifications, and profile menu, supporting mobile and desktop layouts.",
  "frontend/src/components/Layout.tsx": "Page layout combining header, sidebar, main content outlet, bottom nav, and PWA prompt.",
  "frontend/src/components/notifications/NotificationsDropdown.tsx": "Displays a notifications dropdown showing unread counts, lists notifications with icons, and supports marking items as read.",
  "frontend/src/components/profile/ProfileEditDialog.tsx": "Dialog form for editing user profile fields including basic info, bio, images, and social links, with save handling.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Shows a conditional install prompt for the PWA, handling iOS and browser-specific install flows.",
  "frontend/src/components/settings/MoodAISection.tsx": "Settings section allowing authenticated users to enable Mood AI and select their current mood, with loading and update states.",
  "frontend/src/components/Sidebar.tsx": "Left sidebar navigation listing core app routes with active state highlighting.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail, metadata, and channel info with links to video and channel pages.",
  "frontend/src/components/VideoPlayer.tsx": "Streams video chunks via an actor, manages loading and errors, and supports offline and placeholder states.",
  "frontend/src/components/watch/useWatchShare.ts": "Hook that enables sharing a video via Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/components/watch/WatchActionBar.tsx": "Action bar for video pages providing like/dislike, comment, share, save, and download actions with count formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Handles chunked video uploads with progress, cancellation, retry, and metadata upload using an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useMoodSignals.ts": "Tracks watch, like, and activity signals in localStorage and infers a user mood from engagement patterns.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, seeds, and updates user notifications per-identity with unread tracking and read operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating video metadata, interactions, and lists via an actor API.",
  "frontend/src/hooks/useShortUpload.ts": "Uploads short videos as a single blob with progress tracking and returns a direct URL.",
  "frontend/src/index.css": "Sets Tailwind-based theme variables, dark mode styles, utilities, and scrollbar/mobile navigation tweaks.",
  "frontend/src/lib/followCopy.ts": "Contains static UI copy for follow-related labels and text.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names.",
  "frontend/src/lib/videoFileMetadata.ts": "Provides a utility that extracts basic video metadata like duration, resolution, and mime type with a timeout fallback.",
  "frontend/src/lib/videoStreamSource.ts": "Implements a chunk-based video streaming source that fetches, validates, and assembles video chunks into a blob URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and renders the root component.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user's channel page with profile data, editable settings, social links, and mock video listings.",
  "frontend/src/pages/FollowingPage.tsx": "Shows videos from followed channels or prompts login, currently using mock video data.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a list of mock featured videos.",
  "frontend/src/pages/LibraryPage.tsx": "Displays the user's uploaded, liked, and saved videos, integrating real queries for metadata and saved lists.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a multi-section settings interface for general, playback, privacy, and notification preferences.",
  "frontend/src/pages/ShortsPage.tsx": "Displays shorts with mood-based recommendations, scroll tracking, and video playback management.",
  "frontend/src/pages/UploadPage.tsx": "Handles full-length video uploads with metadata extraction, chunked upload flow, and navigation after success.",
  "frontend/src/pages/UploadShortPage.tsx": "Allows uploading short videos under 60 seconds, validating duration and registering the short after blob upload.",
  "frontend/src/pages/WatchPage.tsx": "Shows a video watch page with metadata, interactions, mood tracking, share options, and offline detection.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker with update handling and utilities for unregistering and checking PWA state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, border radii, and theme colors with CSS variable–driven values and animation/typography plugins.",
  "project_state.json": "Project state metadata defining features, new requests, architectural notes, and versioning for a theme-specific notifications dropdown update."
}