{
  "backend/main.mo": "Defines backend actor with types and storage maps for videos, comments, interactions, and user data, including logic for computing interaction summaries.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI opacity changes to specific frontend files and components with metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their purpose and behavior.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes and layout elements.",
  "frontend/index.html": "Base HTML entry point loading the React app, meta tags, and PWA manifest.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and offline fallbacks for the PWA.",
  "frontend/src/App.tsx": "Main React entry setting up routing, theme provider, query client, and service worker registration.",
  "frontend/src/components/account/ProfileMenu.tsx": "Renders a user profile dropdown with avatar, navigation links, and sign‑in/sign‑out logic using Internet Identity and user profile data.",
  "frontend/src/components/account/ThemeToggleMenuItems.tsx": "Provides dropdown menu items for switching between light, dark, and system themes using next-themes.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation component with links and icons for main app sections.",
  "frontend/src/components/ChannelHeader.tsx": "Displays a channel header with avatar, stats, and follow button, with a skeleton loading state.",
  "frontend/src/components/CommentSection.tsx": "Renders comments for a video and provides an input form for posting new comments with authentication handling.",
  "frontend/src/components/FollowButton.tsx": "Button that toggles follow state with optional login and simulated async update.",
  "frontend/src/components/Header.tsx": "Main app header with logo, search bar, notifications, and profile menu, including mobile-specific behavior.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper containing header, sidebar, bottom navigation, and routed content outlet.",
  "frontend/src/components/notifications/NotificationsDropdown.tsx": "Displays a notifications dropdown with unread counts, icons by type, timestamp formatting, and mark‑as‑read actions.",
  "frontend/src/components/profile/ProfileEditDialog.tsx": "Implements a dialog for editing user profile fields, syncing initial data and submitting updates via onSave.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Shows a prompt to install the PWA, handling iOS and browser install flows and dismissal state.",
  "frontend/src/components/settings/MoodAISection.tsx": "Shows and updates user Mood AI preferences, including enabling the feature and selecting a mood, with authentication checks.",
  "frontend/src/components/Sidebar.tsx": "Desktop sidebar navigation listing main routes with active-state highlighting.",
  "frontend/src/components/VideoCard.tsx": "Card displaying video thumbnail, title, channel info, and view/time metadata with navigation links.",
  "frontend/src/components/VideoPlayer.tsx": "Streams video chunks into a blob URL with progress, error handling, and offline/placeholder states.",
  "frontend/src/components/watch/useWatchShare.ts": "Hook providing share functionality using the Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/components/watch/WatchActionBar.tsx": "Renders video action buttons (like, dislike, comment, share, save, download) with count formatting and state indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Handles chunked video uploads with progress tracking, cancel, and retry logic using an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence via React context.",
  "frontend/src/hooks/useMoodSignals.ts": "Tracks watch, like, and activity signals in localStorage and infers a user mood from engagement patterns.",
  "frontend/src/hooks/useNotifications.ts": "Loads, seeds, and manages per‑user notifications in localStorage with read/unread controls.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating video data, metadata, and interactions using an actor backend.",
  "frontend/src/hooks/useShortUpload.ts": "Uploads short videos via ExternalBlob with simple progress tracking and returns a direct URL.",
  "frontend/src/index.css": "Tailwind CSS base file defining light/dark theme variables, utilities, and layout tweaks.",
  "frontend/src/lib/followCopy.ts": "Provides UI copy strings for follow-related actions, navigation labels, and follower count formatting.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges and deduplicates class names using clsx and tailwind-merge.",
  "frontend/src/lib/videoFileMetadata.ts": "Extracts duration and resolution from a video file asynchronously with timeout fallback.",
  "frontend/src/lib/videoStreamSource.ts": "Streams video chunks from the backend, validates them, and can assemble a full blob URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a channel profile with editable fields and mock video listings, handling identity and profile fetching.",
  "frontend/src/pages/FollowingPage.tsx": "Shows videos from followed channels or prompts login, using mock video data.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a static list of mock video cards.",
  "frontend/src/pages/LibraryPage.tsx": "Shows uploaded, liked, and saved videos with identity checks and backend metadata queries.",
  "frontend/src/pages/SettingsPage.tsx": "Implements a multi-section settings UI for general, playback, privacy, and notification preferences.",
  "frontend/src/pages/ShortsPage.tsx": "Displays shorts with mood‑based recommendations, handles scroll-driven watch tracking, video playback, and fallback filtering.",
  "frontend/src/pages/UploadPage.tsx": "Handles authenticated video uploads with chunked uploading, metadata extraction, and redirects to the watch page on success.",
  "frontend/src/pages/UploadShortPage.tsx": "Uploads short videos under 60 seconds using blob storage, then registers the short in the backend and navigates to the shorts feed.",
  "frontend/src/pages/WatchPage.tsx": "Shows a video watch page with metadata, interactions, comments, and watch-time recording, including online/offline handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker in production, with update detection and utilities for unregistering and checking PWA state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with session persistence and hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, radii, and a set of CSS variable–driven colors, with animate and typography plugins enabled.",
  "project_state.json": "Project metadata describing existing and new feature requests related to removing transparency in UI dropdowns and user bar backgrounds."
}