{
  "backend/main.mo": "Motoko canister managing video metadata, chunks, shorts, user profiles, mood preferences, and access control with admin/user-restricted methods.",
  "feature_evidence.json": "Feature evidence report listing files and components related to implementing a light/dark mode toggle via next-themes.",
  "frontend-file-summaries.txt": "JSON-style text file summarizing key frontend source files and their roles in the app.",
  "frontend/index.css": "Tailwind base, components, and utilities with OKLCH theme tokens and dark-mode variable overrides.",
  "frontend/index.html": "Main HTML entry point defining metadata, PWA manifest links, icons, and mounting root for the SPA.",
  "frontend/public/manifest.webmanifest": "Web App Manifest configuring PWA metadata, icons, colors, categories, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, navigation fallback, and exclusions for IC API and video files.",
  "frontend/src/App.tsx": "Root React app wiring TanStack Router, React Query, next-themes ThemeProvider, routes, and PWA service worker registration.",
  "frontend/src/components/account/ProfileMenu.tsx": "Renders a profile dropdown menu with avatar, navigation links, upload options, theme toggle, and sign‑out handling based on authentication state.",
  "frontend/src/components/account/ThemeToggleMenuItems.tsx": "Provides dropdown menu items for switching between light, dark, and system themes with visual selection indicators.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with icon links highlighting the active route.",
  "frontend/src/components/ChannelHeader.tsx": "Displays a channel header with avatar, stats, and follow button, with a skeleton state for loading.",
  "frontend/src/components/CommentSection.tsx": "Renders a comment list and input form with identity-based posting and local state updates.",
  "frontend/src/components/FollowButton.tsx": "Button that toggles follow state with simulated API delay and identity login fallback.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search, notifications, and profile menu, supporting mobile search mode.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with header, sidebar, main content outlet, bottom nav, and PWA prompt.",
  "frontend/src/components/notifications/NotificationsDropdown.tsx": "Shows a notifications dropdown with unread count, icons per notification type, timestamp formatting, and actions to mark notifications as read.",
  "frontend/src/components/profile/ProfileEditDialog.tsx": "Displays a dialog for editing user profile details including basic info, bio, images, and social links, with save handling.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Detects installability and shows a dismissible PWA install prompt, with special handling for iOS.",
  "frontend/src/components/settings/MoodAISection.tsx": "Manages Mood AI preferences, allowing signed‑in users to enable the feature and select a mood, with loading and update states.",
  "frontend/src/components/Sidebar.tsx": "Sidebar navigation listing main app routes with active-state styling.",
  "frontend/src/components/VideoCard.tsx": "Card showing video thumbnail, metadata, and channel info linking to watch and channel pages.",
  "frontend/src/components/VideoPlayer.tsx": "Video player that streams chunks via actor API, showing loading progress, errors, or offline placeholders.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Implements chunked video uploading with progress tracking, cancellation, retry logic, and backend actor integration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useMoodSignals.ts": "Tracks user engagement signals locally and infers a mood based on watch time, likes, and activity, with methods to update and reset signals.",
  "frontend/src/hooks/useNotifications.ts": "Loads and stores user-specific notifications in localStorage, seeding defaults and providing helpers to mark notifications as read.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as videos, metadata, shorts, and user preferences, with placeholders for unimplemented calls.",
  "frontend/src/index.css": "Sets up Tailwind base styles, theme variables for light and dark modes, and utility classes like scrollbar hiding and safe-area padding.",
  "frontend/src/lib/followCopy.ts": "Exports UI copy strings related to following channels, including labels, page text, and a follower count formatter.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/lib/videoFileMetadata.ts": "Extracts video metadata such as duration, resolution, and MIME type by loading the file in a hidden video element with a timeout fallback.",
  "frontend/src/lib/videoStreamSource.ts": "Implements a video chunk streaming helper that fetches chunks from the backend and assembles them into a blob URL for playback.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global CSS.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a channel profile with editable fields, social links, and mock video listings, handling identity-based viewing and editing states.",
  "frontend/src/pages/FollowingPage.tsx": "Shows videos from followed channels or prompts sign‑in, using mock data for followed content.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a static grid of mock featured videos.",
  "frontend/src/pages/LibraryPage.tsx": "Provides signed‑in users access to uploaded and liked videos using mock data, with tabbed navigation.",
  "frontend/src/pages/SettingsPage.tsx": "Implements a multi‑section settings UI managing general, playback, privacy, and notification preferences.",
  "frontend/src/pages/ShortsPage.tsx": "Displays vertical shorts with mood‑based recommendations, scroll‑based playback, and watch/like tracking.",
  "frontend/src/pages/UploadPage.tsx": "Handles authenticated video uploads with metadata extraction, chunked upload, progress display, and redirect on success.",
  "frontend/src/pages/UploadShortPage.tsx": "Short upload page that enforces 60‑second limit, handles video metadata extraction, and submits uploads after Internet Identity login.",
  "frontend/src/pages/WatchPage.tsx": "Video watch page showing player, metadata, likes/dislikes, comments, and mood‑signal tracking with offline detection.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers, unregisters, and checks service worker/PWA status with update handling and error logging.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings for the frontend.",
  "project_state.json": "Project metadata describing architecture, features, known issues, and generated assets for the mytube app."
}