{
  "backend/main.mo": "Canister implementing video metadata, chunk storage, shorts, user preferences, profiles, and access-controlled admin/user APIs.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of key frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/config CSS defining OKLCH color variables, light/dark themes, and global style resets.",
  "frontend/index.html": "Root HTML entry for the app with PWA meta tags, icons, manifest, and script bootstrap.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app name, theme, icons, categories, and display settings.",
  "frontend/public/sw.js": "Service worker handling precaching, runtime caching, navigation fallback, and media caching rules.",
  "frontend/src/App.tsx": "Main React app wiring TanStack Router, React Query, theme provider, routes, and service worker registration.",
  "frontend/src/components/account/ProfileMenu.tsx": "Provides a profile dropdown with sign-in, navigation links, and sign‑out functionality based on user identity and profile data.",
  "frontend/src/components/BottomNav.tsx": "Mobile-only bottom navigation bar with route-based highlighting and links to core app sections.",
  "frontend/src/components/ChannelHeader.tsx": "Displays a channel's header with avatar, stats, and follow button, including a skeleton state while loading.",
  "frontend/src/components/CommentSection.tsx": "Renders a comment list and input form with authentication checks and simulated posting behavior.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing channels with simulated async updates and identity checks.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search, notifications, and profile menu, supporting mobile and desktop layouts.",
  "frontend/src/components/Layout.tsx": "Main app layout combining header, sidebar, bottom navigation, and routed content area.",
  "frontend/src/components/notifications/NotificationsDropdown.tsx": "Renders a notifications dropdown showing unread counts, formatted notifications, and actions to mark items as read.",
  "frontend/src/components/profile/ProfileEditDialog.tsx": "A dialog form for editing and saving user profile fields including bio, social links, and images.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Shows a PWA install prompt with platform-specific behavior, handling install events and user dismissal.",
  "frontend/src/components/settings/MoodAISection.tsx": "Displays and updates Mood AI settings, allowing authenticated users to toggle the feature and select their current mood.",
  "frontend/src/components/Sidebar.tsx": "Left navigation sidebar listing main app sections with active-path highlighting.",
  "frontend/src/components/VideoCard.tsx": "Thumbnail card for a video showing title, channel info, stats, and links to watch or view the channel.",
  "frontend/src/components/VideoPlayer.tsx": "Loads and plays video streams using chunked fetching with progress, error, and offline fallback states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Implements chunked video upload with metadata submission, progress tracking, cancellation, and retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and provider for Internet Identity authentication, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useMoodSignals.ts": "Tracks user engagement signals in localStorage and infers a mood based on watch, like, and activity patterns.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, seeds, and updates user-specific notifications based on Internet Identity, with helpers to mark items as read.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions such as fetching videos, metadata, shorts, and mood preferences, with placeholders for unimplemented calls.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, global styles, scrollbar hiding, and mobile safe-area padding.",
  "frontend/src/lib/followCopy.ts": "Contains static UI copy for follow-related labels, titles, and follower count formatting.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/lib/videoFileMetadata.ts": "Extracts duration, resolution, and MIME type from a video file using a temporary video element with timeout fallback.",
  "frontend/src/lib/videoStreamSource.ts": "Implements incremental backend chunk fetching to assemble streamed video data into a blob URL for playback.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity Provider, rendering the main App component.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user’s channel with profile data, mock videos, and editing for the owner; requires sign‑in and loads banner, social links, and content.",
  "frontend/src/pages/FollowingPage.tsx": "Shows videos from followed channels using mock data, with sign‑in gating and an empty‑state fallback.",
  "frontend/src/pages/HomePage.tsx": "Renders the home feed with mock video cards for discovery.",
  "frontend/src/pages/LibraryPage.tsx": "Displays a user’s uploaded and liked videos in tabbed sections, requiring authentication.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a multi‑section settings UI for general, playback, privacy, and notification preferences.",
  "frontend/src/pages/ShortsPage.tsx": "Fetches and displays vertical shorts with mood‑based recommendations, playback tracking, and scroll‑driven navigation.",
  "frontend/src/pages/UploadPage.tsx": "Handles authenticated video uploads with metadata extraction, progress, error handling, and navigation on success.",
  "frontend/src/pages/UploadShortPage.tsx": "Page for uploading short videos with duration validation, Internet Identity auth, and React Query mutation to submit the short.",
  "frontend/src/pages/WatchPage.tsx": "Video watch page showing metadata, player, comments, like/dislike logic, offline detection, and activity tracking via mood signals.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker in production, provides unregister helper, and utilities for standalone/offline checks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme, colors, typography, animations, and content scanning paths for the frontend.",
  "project_state.json": "Project state file describing app goals, architecture notes, known issues, generated assets, and existing feature metadata."
}