{
  "backend/main.mo": "Motoko canister defining video metadata, chunk storage, user data, interactions, and comments with functions for computing interaction summaries.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test mappings for two Tailwind-related UI fixes.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all major frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "Root HTML document setting up PWA metadata, icons, theme color, and mounting point for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, display mode, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, navigation fallback, and cache cleanup for PWA support.",
  "frontend/src/App.tsx": "React root component configuring TanStack Router, React Query, theming, service worker registration, and route definitions.",
  "frontend/src/components/account/ProfileMenu.tsx": "Renders a user profile dropdown with avatar, navigation links, theme toggle, upload options, and sign‑in/out handling using Internet Identity.",
  "frontend/src/components/account/ThemeToggleMenuItems.tsx": "Provides dropdown items to switch between light, dark, or system theme using next‑themes.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar component rendering route links with icons, active highlighting, and Tailwind-based styling.",
  "frontend/src/components/ChannelHeader.tsx": "Displays a channel header with avatar, stats, and follow button, with a skeleton state during loading.",
  "frontend/src/components/CommentSection.tsx": "Renders comments for a video and provides an authenticated form to post new comments, with loading and fallback states.",
  "frontend/src/components/FollowButton.tsx": "A button that toggles follow status with simulated async behavior and optional callback.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search, notifications, and profile menu, including mobile-specific search UI.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper containing header, sidebar, bottom navigation, and routed content area.",
  "frontend/src/components/notifications/NotificationsDropdown.tsx": "Displays a notifications dropdown with unread counts, icons, timestamps, and actions to mark items as read.",
  "frontend/src/components/profile/ProfileEditDialog.tsx": "A dialog form for editing and saving user profile details including bio, social links, and images.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Handles PWA installation prompts for web and iOS, showing a dismissible install card when appropriate.",
  "frontend/src/components/settings/MoodAISection.tsx": "Shows and updates Mood AI preferences, including enabling the feature and selecting a mood, with authentication checks.",
  "frontend/src/components/Sidebar.tsx": "Desktop sidebar navigation listing main app routes with active-state styling.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail, metadata, and channel info with links to watch or visit the channel.",
  "frontend/src/components/VideoPlayer.tsx": "Streams video chunks via actor-based loader, showing progress, errors, offline fallback, or a placeholder when metadata is missing.",
  "frontend/src/components/watch/useWatchShare.ts": "Custom hook to share a video via Web Share API or clipboard fallback with toast feedback.",
  "frontend/src/components/watch/WatchActionBar.tsx": "Renders action buttons for like/dislike, comments, sharing, saving, and downloading on a video watch page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Provides a hook for chunked video uploads with progress, cancellation, retry, and metadata handling via an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook that manages identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMoodSignals.ts": "Tracks local engagement signals and infers a mood based on watch patterns, likes, and activity, persisting data to localStorage.",
  "frontend/src/hooks/useNotifications.ts": "Manages user notifications with localStorage persistence, seeding demo data and providing read/unread helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data such as videos, metadata, and interaction states, with placeholder and real actor calls.",
  "frontend/src/hooks/useShortUpload.ts": "Handles short video uploads using ExternalBlob with progress tracking and returns a direct URL.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, scrollbar hiding, and mobile safe-area support.",
  "frontend/src/lib/followCopy.ts": "Contains copy text and formatting helpers for follow-related UI labels.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/lib/videoFileMetadata.ts": "Provides an interface and async helper to extract video duration, resolution, and MIME type using HTML5 metadata loading with timeout fallback.",
  "frontend/src/lib/videoStreamSource.ts": "Implements a chunk-based video streaming source that fetches validated ranges from the backend and can assemble them into a Blob URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/ChannelPage.tsx": "Displays a user channel with profile data, mock videos, social links, and profile editing when viewing own channel.",
  "frontend/src/pages/FollowingPage.tsx": "Shows videos from followed channels with sign-in gating and mock video data.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a simple grid of mock video cards.",
  "frontend/src/pages/LibraryPage.tsx": "Displays uploaded, liked, and saved videos using tabs, fetching metadata and gating access by sign‑in.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a multi-section settings UI for general, playback, privacy, and notifications with local state controls.",
  "frontend/src/pages/ShortsPage.tsx": "Displays a scrollable feed of shorts with mood-based recommendations, watch tracking, and video playback controls.",
  "frontend/src/pages/UploadPage.tsx": "Provides a form to upload full-length videos with metadata extraction and chunked upload handling.",
  "frontend/src/pages/UploadShortPage.tsx": "Allows users to upload short videos under 60 seconds, validating duration and registering the short in the backend.",
  "frontend/src/pages/WatchPage.tsx": "Renders a video watch page with metadata, interactions, comments, sharing, and mood signal tracking.",
  "frontend/src/pwa/registerServiceWorker.ts": "Handles service worker registration, update detection, unregistration, and PWA environment checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, border radii, and an HSL-based color system including a bottom nav bar color (#1a1a1a).",
  "project_state.json": "Project state describing a fix request to ensure the bottom tab bar background reliably uses the darker #1a1a1a color."
}