{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing PWA-related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and pages.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "Main HTML entry including PWA meta tags, manifest link, icons, and script loader.",
  "frontend/public/manifest.webmanifest": "Web App Manifest defining PWA metadata, start behavior, theme colors, and app icons.",
  "frontend/public/sw.js": "Service worker implementing precache, runtime caching, and offline strategies excluding video files.",
  "frontend/src/App.tsx": "React root app configuring TanStack Router routes and theme provider.",
  "frontend/src/components/ChannelHeader.tsx": "Channel header UI displaying channel details and follow button.",
  "frontend/src/components/CommentSection.tsx": "Comment section with posting form, identity check, and comment list rendering.",
  "frontend/src/components/FollowButton.tsx": "Toggle follow state with mock async call and Internet Identity login fallback.",
  "frontend/src/components/Header.tsx": "Top navigation bar with search, upload, and identity-based user menu.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, sidebar, and routed main content area.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar listing main app sections with active-state styling.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail, metadata, and links to video and channel pages.",
  "frontend/src/components/VideoPlayer.tsx": "Placeholder video player showing offline or default UI states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login state and persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for videos and follow actions, currently using placeholders.",
  "frontend/src/index.css": "Tailwind base styles and theme CSS variables for light and dark modes.",
  "frontend/src/lib/followCopy.ts": "Centralized UI copy for follow-related labels and formatting.",
  "frontend/src/lib/utils.ts": "Utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point wiring React, Internet Identity provider, and react-query.",
  "frontend/src/pages/ChannelPage.tsx": "Renders a channel header and mock video list, checking if the channel is the user's own.",
  "frontend/src/pages/FollowingPage.tsx": "Displays followed-channel videos or a sign‑in prompt, using mock data and conditional UI states.",
  "frontend/src/pages/HomePage.tsx": "Renders the home feed with a static list of mock videos displayed in a grid.",
  "frontend/src/pages/LibraryPage.tsx": "Shows uploaded and liked videos for signed‑in users, with tabbed navigation and mock data.",
  "frontend/src/pages/SettingsPage.tsx": "Implements a multi‑section settings UI with stateful controls for general, playback, privacy, and notification preferences.",
  "frontend/src/pages/UploadPage.tsx": "Provides a video upload form requiring sign‑in and simulates an upload before navigating home.",
  "frontend/src/pages/WatchPage.tsx": "Displays a video player, metadata, like/dislike logic, offline alerts, and a mock comments section.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers, unregisters, and checks status of service workers with environment checks and update handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, summarizing implemented features for a YouTube‑like app including UI shell, auth, video handling, browsing, interactions, profiles, following, and library."
}