{
  "kind": "build_request",
  "title": "Set notifications dropdown background colors for light/dark mode",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the notifications dropdown panel background so that it is #1a1a1a in dark mode and white (#ffffff) in light mode, applying the change only to the notifications dropdown surface (not the bell trigger button and not other dropdowns).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "notifications bar Dropdown ka background color: #1a1a1a ... dark mood aur light mood ke liye light color",
          "white"
        ]
      },
      "acceptanceCriteria": [
        "When the app theme is dark, the Notifications dropdown panel surface (DropdownMenuContent and its internal panel areas) renders with background #1a1a1a.",
        "When the app theme is light, the Notifications dropdown panel surface renders with background #ffffff.",
        "No other dropdown menus/components have their background colors changed as part of this update.",
        "There are no hardcoded inline backgroundColor styles left that force #1a1a1a in light mode inside the notifications dropdown."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not modify files under frontend/src/components/ui (compose them instead).",
    "Keep changes limited to the notifications dropdown; do not alter global theme tokens in a way that affects other popovers/dropdowns."
  ],
  "nonGoals": [
    "Changing hover/focus colors beyond what is required to support the requested background colors.",
    "Updating the profile menu dropdown or mobile search dropdown (already separate).",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}