{
  "kind": "build_request",
  "title": "Make mobile bottom tab bar strip background #1a1a1a",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the mobile bottom navigation bar container (the strip behind the icons) to use a clearly visible, non-transparent background color of #1a1a1a while keeping the existing per-button background styling and active-state highlight behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1. #1a1a1a.  2. neeche icons ke peeche wali background strip.  3. halka shade change",
          "build karo"
        ]
      },
      "acceptanceCriteria": [
        "On mobile (md:hidden BottomNav), the bar behind the icons renders with background color #1a1a1a (visibly darker than before).",
        "The icon/button backgrounds (bg-bottom-nav-button) remain the same as before.",
        "Active tab styling remains the same as before (active text-primary and icon fill-primary).",
        "The background color is not transparent and is visually consistent across routes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the styling implementation so the bottom tab bar background color change reliably applies (i.e., ensure the Tailwind color token used by BottomNav resolves to the intended color instead of being ignored due to incompatible CSS variable formatting).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8"
        ],
        "quotes": [
          "KAHA HU KUCH BHI NHI HU TAB BAR KE STRIP ME KUCH BHI CHANGE NHI CHANGE DEKHA RAHA HAI TUME PHOTO ME KUCH BHI CHANGE NHI HUVA HAI",
          "1. #1a1a1a.  2. neeche icons ke peeche wali background strip.  3. halka shade change"
        ]
      },
      "acceptanceCriteria": [
        "After implementation, changing the bottom-nav bar color results in an observable UI difference in the running app (not just in code).",
        "No regressions to other theme colors outside the bottom navigation bar strip."
      ]
    }
  ],
  "constraints": [
    "Backend must remain unchanged (no canister changes required).",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Redesigning the entire theme or changing primary/secondary colors.",
    "Changing BottomNav layout, labels, routes, or icon set.",
    "Adding new navigation items or new pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}