{
  "kind": "build_request",
  "title": "Remove transparency behind user/profile bar dropdown (solid background)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the Profile (user) dropdown menu background fully opaque (no transparency/glass effect), matching the screenshot issue: the area behind the user bar/profile dropdown should not be see-through.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "uars bar ke peeche wala background transparent nhi dekhana chaheye yaar bhai jase photo me dekha ra hai vaise nhi dekhana chaheye",
          "build karo"
        ]
      },
      "acceptanceCriteria": [
        "When opening the ProfileMenu dropdown, the dropdown panel uses an opaque background color (no alpha/opacity and no backdrop blur/glass effect).",
        "In dark mode, the dropdown panel appears as a solid dark surface; in light mode, it appears as a solid light surface.",
        "Text/icons inside the dropdown remain readable and unchanged in layout/spacing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the same fully opaque background treatment to the Notifications dropdown so both top-right dropdowns have consistent non-transparent surfaces.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ab sem ayse he notifications bar karo bhi karo",
          "ays a transparent nhi dekhana chaye yaar bhai"
        ]
      },
      "acceptanceCriteria": [
        "When opening the Notifications dropdown, the dropdown panel and header area are fully opaque (no transparency/glass effect).",
        "Unread highlighting (e.g., accent backgrounds) remains visible but does not make the overall dropdown appear transparent.",
        "The dropdown remains aligned to the right and keeps its current width and scroll behavior."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources); implement styling fixes by adjusting component usage/classes in app components (e.g., ProfileMenu, NotificationsDropdown).",
    "Backend logic must remain unchanged (this is a UI-only change)."
  ],
  "nonGoals": [
    "Implementing a backend notifications system (notifications are already client-side).",
    "Changing navigation structure, adding new menu items, or altering authentication behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}