{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make header dropdown menus fully opaque (Profile + Notifications)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the ProfileMenu dropdown panel fully opaque in both light and dark themes without changing layout.",
      "acceptanceCriteria": [
        "When opening the ProfileMenu dropdown, the dropdown panel uses an opaque background color (no alpha/opacity and no backdrop blur/glass effect).",
        "In dark mode, the dropdown panel appears as a solid dark surface; in light mode, it appears as a solid light surface.",
        "Text/icons inside the dropdown remain readable and unchanged in layout/spacing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/account/ProfileMenu.tsx",
          "operation": "modify",
          "description": "Update the shadcn-ui DropdownMenuContent usage to force a fully opaque surface (e.g., solid theme background via bg-popover/text-popover-foreground) and explicitly disable any glass effect (e.g., remove/override any backdrop blur / translucent utilities). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Notifications dropdown panel and header fully opaque while preserving unread highlighting, alignment, width, and scrolling.",
      "acceptanceCriteria": [
        "When opening the Notifications dropdown, the dropdown panel and header area are fully opaque (no transparency/glass effect).",
        "Unread highlighting (e.g., accent backgrounds) remains visible but does not make the overall dropdown appear transparent.",
        "The dropdown remains aligned to the right and keeps its current width and scroll behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notifications/NotificationsDropdown.tsx",
          "operation": "modify",
          "description": "Update the shadcn-ui DropdownMenuContent usage to apply a solid opaque surface for the entire dropdown (including the header area) using theme tokens (e.g., bg-popover/text-popover-foreground) and explicitly disable any blur/translucent utilities; keep existing w-80, p-0, align=end, and ScrollArea behavior unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}