{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile bottom tab bar strip background #1a1a1a",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the mobile BottomNav strip behind icons use a solid #1a1a1a background while keeping button and active-state styling unchanged.",
      "acceptanceCriteria": [
        "On mobile (md:hidden BottomNav), the bar behind the icons renders with background color #1a1a1a (visibly darker than before).",
        "The icon/button backgrounds (bg-bottom-nav-button) remain the same as before.",
        "Active tab styling remains the same as before (active text-primary and icon fill-primary).",
        "The background color is not transparent and is visually consistent across routes."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update the Tailwind color token for 'bottom-nav-bar' so 'bg-bottom-nav-bar' resolves to a solid #1a1a1a (without changing 'bottom-nav-button' or active-state related tokens)."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Confirm the BottomNav container continues to use the existing 'bg-bottom-nav-bar' class and that per-button background and active-state classes remain unchanged after the color token update."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix BottomNav background styling reliability by ensuring the Tailwind token used for the bar background resolves correctly (not ignored due to CSS variable formatting).",
      "acceptanceCriteria": [
        "After implementation, changing the bottom-nav bar color results in an observable UI difference in the running app (not just in code).",
        "No regressions to other theme colors outside the bottom navigation bar strip."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Replace the current CSS-variable-based definition for the 'bottom-nav-bar' Tailwind color with a compatible value format (e.g., a direct hex color) so Tailwind-generated 'bg-bottom-nav-bar' styles are applied reliably, without altering other theme tokens."
        }
      ]
    }
  ]
}